thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: Synchronous mode
1: Asynchronous mode

The ADC does a sample-and-hold before conversion. In synchronous mode the sampling starts when the ADC clock detects a rising edge on the trigger signal. Jitter/uncertainty will be inferred in the detection if the trigger signal originates from a domain that is asynchronous to the ADC clock. SMPL_CYCLE_EXP  determines the the duration of sampling.
Conversion starts immediately after sampling ends.

In asynchronous mode the sampling is continuous when enabled. Sampling ends and conversion starts immediately with the rising edge of the trigger signal. Sampling restarts when the conversion has finished.
Asynchronous mode is useful when it is important to avoid jitter in the sampling instant of an externally driven signal</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SMPL_CYCLE_EXP</name>
              <description>[6:3] Controls the sampling duration before conversion when the ADC is operated in synchronous mode (SMPL_MODE = 0). The setting has no effect in asynchronous mode. The sampling duration is given as 2^(SMPL_CYCLE_EXP + 1) / 6 us.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10P9_MS</name>
                  <value>15</value>
                  <description>65536x 6 MHz clock periods = 10.9ms</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5P46_MS</name>
                  <value>14</value>
                  <description>32768x 6 MHz clock periods = 5.46ms</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P73_MS</name>
                  <value>13</value>
                  <description>16384x 6 MHz clock periods = 2.73ms</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P37_MS</name>
                  <value>12</value>
                  <description>8192x 6 MHz clock periods = 1.37ms</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>682_US</name>
                  <value>11</value>
                  <description>4096x 6 MHz clock periods = 682us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>341_US</name>
                  <value>10</value>
                  <description>2048x 6 MHz clock periods = 341us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>170_US</name>
                  <value>9</value>
                  <description>1024x 6 MHz clock periods = 170us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>85P3_US</name>
                  <value>8</value>
                  <description>512x 6 MHz clock periods = 85.3us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42P6_US</name>
                  <value>7</value>
                  <description>256x 6 MHz clock periods = 42.6us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21P3_US</name>
                  <value>6</value>
                  <description>128x 6 MHz clock periods = 21.3us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10P6_US</name>
                  <value>5</value>
                  <description>64x 6 MHz clock periods = 10.6us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5P3_US</name>
                  <value>4</value>
                  <description>32x 6 MHz clock periods = 5.3us</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P7_US</name>
                  <value>3</value>
                  <description>16x 6 MHz clock periods = 2.7us</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[2:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESET_N</name>
              <description>[1:1] Reset ADC digital subchip, active low. ADC must be reset every time it is reconfigured.

0: Reset
1: Normal operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] ADC Enable

0: Disable
1: Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC1</name>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <description>ADC Control 1

ADC Comparator Control. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SCALE_DIS</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCREF0</name>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
          <description>ADC Reference 0

Control reference used by the ADC. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>SPARE7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>REF_ON_IDLE</name>
              <description>[6:6] Enable ADCREF in IDLE state.

