thenewwazoo/cc1352p1f3/cc1352p1f3.svd
AON Event Source selecting 1 of 8 events routed to AON_PMCTRL for waking up the MCU domain from Power Off or Power Down.
Note:</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>63</value>
                  <description>No event, always low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC_N</name>
                  <value>56</value>
                  <description>Comparator B not triggered. Asynchronous signal directly from AUX Comparator B (inverted) as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC</name>
                  <value>55</value>
                  <description>Comparator B triggered. Asynchronous signal directly from the AUX Comparator B as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_VOLT</name>
                  <value>54</value>
                  <description>BATMON voltage update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP</name>
                  <value>53</value>
                  <description>BATMON temperature update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>52</value>
                  <description>AUX Timer 1 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>51</value>
                  <description>AUX Timer 0 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>50</value>
                  <description>TDC completed or timed out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>49</value>
                  <description>ADC conversion completed</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>48</value>
                  <description>Comparator B triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>47</value>
                  <description>Comparator A triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV2</name>
                  <value>46</value>
                  <description>AUX Software triggered event #2. Triggered by AUX_EVCTL:SWEVSET.SWEV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>45</value>
                  <description>AUX Software triggered event #1. Triggered by AUX_EVCTL:SWEVSET.SWEV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV0</name>
                  <value>44</value>
                  <description>AUX Software triggered event #0. Triggered by AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG</name>
                  <value>43</value>
                  <description>JTAG generated event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_UPD</name>
                  <value>42</value>
                  <description>RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_COMB_DLY</name>
                  <value>41</value>
                  <description>RTC combined delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_DLY</name>
                  <value>40</value>
                  <description>RTC channel 2 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1_DLY</name>
                  <value>39</value>
                  <description>RTC channel 1 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0_DLY</name>
                  <value>38</value>
                  <description>RTC channel 0 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2</name>
                  <value>37</value>
                  <description>RTC channel 2 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1</name>
                  <value>36</value>
                  <description>RTC channel 1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0</name>
                  <value>35</value>
                  <description>RTC channel 0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD</name>
                  <value>32</value>
                  <description>Edge detect on any PAD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_COMBINED</name>
                  <value>9</value>
                  <description>Combined event from BATMON</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP_LL</name>
                  <value>8</value>
                  <description>BATMON event: Temperature level below lower limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP_UL</name>
                  <value>7</value>
                  <description>BATMON event: Temperature level above upper limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_BATT_LL</name>
                  <value>6</value>
                  <description>BATMON event: Battery level below lower limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_BATT_UL</name>
                  <value>5</value>
                  <description>BATMON event: Battery level above upper limit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>4</value>
                  <description>Event 3 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>3</value>
                  <description>Event 2 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>2</value>
                  <description>Event 1 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>1</value>
                  <description>Event 0 from AUX TImer2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOEV_MCU_WU</name>
                  <value>0</value>
                  <description>Edge detect IO event from the DIO(s) which have enabled contribution to IOEV_MCU_WU in [MCU_IOC:IOCFGx.IOEV_MCU_WU_EN]</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3F3F3F3F</resetValue>
        </register>
        <register>
          <name>EVTOMCUSEL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Event Selector For MCU Event Fabric 

