thenewwazoo/cc1352p1f3/cc1352p1f3.svd
To clear an event flag, write to EVTOMCUFLAGSCLR or write 0 to event flag in this register. Follow procedure described in AUX_SYSIF:WUCLR to clear AUX_WU_EV event flag.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>[15:15] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_PULSE occurs on EVSTAT3.AUX_TIMER2_PULSE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>[14:14] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV3 occurs on EVSTAT3.AUX_TIMER2_EV3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>[13:13] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV2 occurs on EVSTAT3.AUX_TIMER2_EV2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>[12:12] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV1 occurs on EVSTAT3.AUX_TIMER2_EV1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>[11:11] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV0 occurs on EVSTAT3.AUX_TIMER2_EV0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>[10:10] This event flag is set when level selected by EVTOMCUPOL.AUX_ADC_IRQ occurs on EVSTAT3.AUX_ADC_IRQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>[9:9] This event flag is set when level selected by EVTOMCUPOL.MCU_OBSMUX0 occurs on EVSTAT2.MCU_OBSMUX0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] This event flag is set when level selected by EVTOMCUPOL.AUX_ADC_FIFO_ALMOST_FULL occurs on EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[7:7] This event flag is set when level selected by EVTOMCUPOL.AUX_ADC_DONE occurs on EVSTAT3.AUX_ADC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] This event flag is set when level selected by EVTOMCUPOL.AUX_SMPH_AUTOTAKE_DONE occurs on EVSTAT3.AUX_SMPH_AUTOTAKE_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER1_EV occurs on EVSTAT3.AUX_TIMER1_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[4:4] This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER0_EV occurs on EVSTAT3.AUX_TIMER0_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[3:3] This event flag is set when level selected by EVTOMCUPOL.AUX_TDC_DONE occurs on EVSTAT3.AUX_TDC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPB occurs on EVSTAT2.AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPA occurs on EVSTAT2.AUX_COMPA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>[0:0] This event flag is set when level selected by EVTOMCUPOL.AUX_WU_EV occurs on reduction-OR of the AUX_SYSIF:WUFLAGS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOMCUPOL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Event To MCU Polarity

Event source polarity configuration for EVTOMCUFLAGS.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>[15:15] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_PULSE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>[14:14] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>[13:13] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>[12:12] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>[11:11] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>[10:10] Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_IRQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>[9:9] Select the event source level that sets EVTOMCUFLAGS.MCU_OBSMUX0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[7:7] Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] Select the event source level that sets EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER1_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[4:4] Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER0_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[3:3] Select the event source level that sets EVTOMCUFLAGS.AUX_TDC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>1</value>
                  <description>Falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0</value>
                  <description>Rising edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>1</value>
                  <description>Falling edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0</value>
                  <description>Rising edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>[0:0] Select the event source level that sets EVTOMCUFLAGS.AUX_WU_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOMCUFLAGSCLR</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Events To MCU Flags Clear

Clear event flags in EVTOMCUFLAGS. 

In order to clear a level sensitive event flag, the event must be deasserted.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>[15:15] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_PULSE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>[14:14] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV3.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>[13:13] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV2.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>[12:12] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV1.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>[11:11] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV0.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>[10:10] Write 1 to clear EVTOMCUFLAGS.AUX_ADC_IRQ.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>[9:9] Write 1 to clear EVTOMCUFLAGS.MCU_OBSMUX0.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] Write 1 to clear EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[7:7] Write 1 to clear EVTOMCUFLAGS.AUX_ADC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] Write 1 to clear EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER1_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[4:4] Write 1 to clear EVTOMCUFLAGS.AUX_TIMER0_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[3:3] Write 1 to clear EVTOMCUFLAGS.AUX_TDC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>[0:0] Write 1 to clear EVTOMCUFLAGS.AUX_WU_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMBEVTOMCUMASK</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Combined Event To MCU Mask

