thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: Software wakeup 3 not triggered.
1: Software wakeup 3 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SW_WU2</name>
              <description>[6:6] Software wakeup 2 flag.

0: Software wakeup 2 not triggered.
1: Software wakeup 2 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SW_WU1</name>
              <description>[5:5] Software wakeup 1 flag.

0: Software wakeup 1 not triggered.
1: Software wakeup 1 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SW_WU0</name>
              <description>[4:4] Software wakeup 0 flag.

0: Software wakeup 0 not triggered.
1: Software wakeup 0 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PROG_WU3</name>
              <description>[3:3] Programmable wakeup 3.

0: Programmable wakeup 3 not triggered.
1: Programmable wakeup 3 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PROG_WU2</name>
              <description>[2:2] Programmable wakeup 2.

0: Programmable wakeup 2 not triggered.
1: Programmable wakeup 2 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PROG_WU1</name>
              <description>[1:1] Programmable wakeup 1.

0: Programmable wakeup 1 not triggered.
1: Programmable wakeup 1 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PROG_WU0</name>
              <description>[0:0] Programmable wakeup 0.

0: Programmable wakeup 0 not triggered.
1: Programmable wakeup 0 triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WUFLAGSCLR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Wakeup Flags Clear

This register clears AUX wakeup flags WUFLAGS. 

To clear programmable wakeup flags you must disable the AUX wakeup output first. After the programmable wakeup flags are cleared you must re-enable the AUX wakeup output. Write WUGATE to disable or enable the AUX wakeup output. This procedure is not required when you want to clear a software-triggered wakeup.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SW_WU3</name>
              <description>[7:7] Clear software wakeup flag 3.

0: No effect.
1: Clear WUFLAGS.SW_WU3. Keep high until WUFLAGS.SW_WU3 is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SW_WU2</name>
              <description>[6:6] Clear software wakeup flag 2.

0: No effect.
1: Clear WUFLAGS.SW_WU2. Keep high until WUFLAGS.SW_WU2 is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SW_WU1</name>
              <description>[5:5] Clear software wakeup flag 1.

0: No effect.
1: Clear WUFLAGS.SW_WU1. Keep high until WUFLAGS.SW_WU1 is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SW_WU0</name>
              <description>[4:4] Clear software wakeup flag 0.

0: No effect.
1: Clear WUFLAGS.SW_WU0. Keep high until WUFLAGS.SW_WU0 is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PROG_WU3</name>
              <description>[3:3] Programmable wakeup flag 3.

0: No effect.
1: Clear WUFLAGS.PROG_WU3. Keep high until WUFLAGS.PROG_WU3 is 0.

The wakeup flag becomes edge sensitive if you write PROG_WU3 to 0 when PROGWU3CFG.EN is 1.
The wakeup flag becomes level sensitive if you write PROG_WU3 to 0 when PROGWU3CFG.EN is 0, then set PROGWU3CFG.EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PROG_WU2</name>
              <description>[2:2] Programmable wakeup flag 2.

0: No effect.
1: Clear WUFLAGS.PROG_WU2. Keep high until WUFLAGS.PROG_WU2 is 0.

The wakeup flag becomes edge sensitive if you write PROG_WU2 to 0 when PROGWU2CFG.EN is 1.
The wakeup flag becomes level sensitive if you write PROG_WU2 to 0 when PROGWU2CFG.EN is 0, then set PROGWU2CFG.EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PROG_WU1</name>
              <description>[1:1] Programmable wakeup flag 1.

0: No effect.
1: Clear WUFLAGS.PROG_WU1. Keep high until WUFLAGS.PROG_WU1 is 0.

The wakeup flag becomes edge sensitive if you write PROG_WU1 to 0 when PROGWU1CFG.EN is 1.
The wakeup flag becomes level sensitive if you write PROG_WU1 to 0 when PROGWU1CFG.EN is 0, then set PROGWU1CFG.EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PROG_WU0</name>
              <description>[0:0] Programmable wakeup flag 0.

0: No effect.
1: Clear WUFLAGS.PROG_WU0. Keep high until WUFLAGS.PROG_WU0 is 0.

