thenewwazoo/cc1352p1f3/cc1352p1f3.svd
The counter restarts from 0 when you enable Timer 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1TARGET</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Timer 1 Target

Timer 1 counter target value</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 1 target value.

Manual Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than VALUE. 
- AUX_TIMER1_EV pulses high for 1 peripheral clock period when the counter value is equal to or greater than VALUE.

Note: When VALUE is 0, Timer 1 counts to 1. AUX_TIMER1_EV pulses high for 1 peripheral clock period.

Continuous Reload Mode:
- Timer 1 increments until the counter value becomes equal to or greater than ( VALUE - 1), then restarts from 0.
- AUX_TIMER1_EV pulses high for 1 peripheral clock period when the counter value is 0, except for when you enable the timer.

Note: When VALUE is less than 2, Timer 1 counter value remains 0. AUX_TIMER1_EV goes high and remains high 1 peripheral clock period after you enable the timer.


It is allowed to update the VALUE while the timer runs.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CNTR</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Timer 1 Counter</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 1 counter value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TIMER2</name>
      <baseAddress>0x400C3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Timer2 (AUX_TIMER2) offers flexible: 
- generation of waveforms and events.
- capture of signal period and duty cycle. 
- generation of single clock pulse.

It consists of a: 
- 16-bit counter.
- 4 capture compare channels.
- 4 event outputs, which are mapped to AUX event bus, see EVCTL.

Each channel subscribes to the asynchronous AUX event bus. They can control one or more event outputs in both capture and compare modes.  AUX_SYSIF:TIMER2CLKCTL.SRC selects clock source for the timer.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Timer Control</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CH3_RESET</name>
              <description>[6:6] Channel 3 reset.

0: No effect.
1: Reset CH3CC, CH3PCC, CH3EVCFG, and CH3CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CH2_RESET</name>
              <description>[5:5] Channel 2 reset.

0: No effect.
1: Reset CH2CC, CH2PCC, CH2EVCFG, and CH2CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CH1_RESET</name>
              <description>[4:4] Channel 1 reset.

0: No effect.
1: Reset CH1CC, CH1PCC, CH1EVCFG, and CH1CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CH0_RESET</name>
              <description>[3:3] Channel 0 reset.

0: No effect.
1: Reset CH0CC, CH0PCC, CH0EVCFG, and CH0CCFG.

Read returns 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TARGET_EN</name>
              <description>[2:2] Select counter target value.

You must select TARGET to use shadow target functionality.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TARGET</name>
                  <value>1</value>
                  <description>TARGET.VALUE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTR_MAX</name>
                  <value>0</value>
                  <description>65535</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] Timer mode control.

