thenewwazoo/cc1352p1f3/cc1352p1f3.svd
The four events connect to the asynchronous AUX event bus: 
- Event 0 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.
- Event 1 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.
- Event 2 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.
- Event 3 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EV3_SET</name>
              <description>[7:7] Set event 3.

Write 1 to set event 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV3_CLR</name>
              <description>[6:6] Clear event 3.

Write 1 to clear event 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EV2_SET</name>
              <description>[5:5] Set event 2.

Write 1 to set event 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>EV2_CLR</name>
              <description>[4:4] Clear event 2.

Write 1 to clear event 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>EV1_SET</name>
              <description>[3:3] Set event 1.

Write 1 to set event 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>EV1_CLR</name>
              <description>[2:2] Clear event 1.

Write 1 to clear event 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>EV0_SET</name>
              <description>[1:1] Set event 0.

Write 1 to set event 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EV0_CLR</name>
              <description>[0:0] Clear event 0.

Write 1 to clear event 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PULSETRIG</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Pulse Trigger</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TRIG</name>
              <description>[0:0] Pulse trigger.

Write 1 to generate a pulse to AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE. Pulse width equals the duty cycle of AUX_SYSIF:TIMER2CLKCTL.SRC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH0EVCFG</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Channel 0 Event Configuration

This register configures channel function and enables event outputs.

Each channel has an edge-detection circuit with memory. The circuit is: 
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
The flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EV3_GEN</name>
              <description>[7:7] Event 3 enable.

0: Channel 0 does not control event 3.
1: Channel 0 controls event 3.

 When 0 &lt; CCACT &lt; 8, EV3_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>[6:6] Event 2 enable.

0: Channel 0 does not control event 2.
1: Channel 0 controls event 2.

 When 0 &lt; CCACT &lt; 8, EV2_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>[5:5] Event 1 enable.

0: Channel 0 does not control event 1.
1: Channel 0 controls event 1.

 When 0 &lt; CCACT &lt; 8, EV1_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>[4:4] Event 0 enable.

0: Channel 0 does not control event 0.
1: Channel 0 controls event 0.

 When 0 &lt; CCACT &lt; 8, EV0_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CCACT</name>
              <description>[3:0] Capture-Compare action.

Capture-Compare action defines 15 different channel functions that utilize capture, compare, and zero events.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE_ON_CMP</name>
                  <value>15</value>
                  <description>Pulse on compare repeatedly. 

