thenewwazoo/cc1352p1f3/cc1352p1f3.svd
        <register>
          <name>CCFG_PROT_127_96</name>
          <addressOffset>0x1ffc</addressOffset>
          <size>32</size>
          <description>Protect Sectors 96-127
Each bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use.</description>
          <fields>
            <field>
              <name>WRT_PROT_SEC_127</name>
              <description>[31:31] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_126</name>
              <description>[30:30] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_125</name>
              <description>[29:29] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_124</name>
              <description>[28:28] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_123</name>
              <description>[27:27] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_122</name>
              <description>[26:26] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_121</name>
              <description>[25:25] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_120</name>
              <description>[24:24] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_119</name>
              <description>[23:23] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_118</name>
              <description>[22:22] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_117</name>
              <description>[21:21] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_116</name>
              <description>[20:20] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_115</name>
              <description>[19:19] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_114</name>
              <description>[18:18] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_113</name>
              <description>[17:17] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_112</name>
              <description>[16:16] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_111</name>
              <description>[15:15] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_110</name>
              <description>[14:14] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_109</name>
              <description>[13:13] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_108</name>
              <description>[12:12] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_107</name>
              <description>[11:11] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_106</name>
              <description>[10:10] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_105</name>
              <description>[9:9] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_104</name>
              <description>[8:8] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_103</name>
              <description>[7:7] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_102</name>
              <description>[6:6] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_101</name>
              <description>[5:5] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_100</name>
              <description>[4:4] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_99</name>
              <description>[3:3] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_98</name>
              <description>[2:2] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_97</name>
              <description>[1:1] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_96</name>
              <description>[0:0] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
