thenewwazoo/cc1352p1f3/cc1352p1f3.svd
Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the HASHMODE.NEW_HASH bit is 0 when starting a hash session).

New hash:
When initiating a new hash session (theHASHMODE.NEW_HASH bit is 1), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDIGESTI</name>
          <addressOffset>0x6e0</addressOffset>
          <size>32</size>
          <description>HASH Digest I
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[287:256]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the HASHMODE.NEW_HASH bit is 0 when starting a hash session).

New hash:
When initiating a new hash session (theHASHMODE.NEW_HASH bit is 1), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDIGESTJ</name>
          <addressOffset>0x6e4</addressOffset>
          <size>32</size>
          <description>HASH Digest J
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[319:288]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the HASHMODE.NEW_HASH bit is 0 when starting a hash session).

New hash:
When initiating a new hash session (theHASHMODE.NEW_HASH bit is 1), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDIGESTK</name>
          <addressOffset>0x6e8</addressOffset>
          <size>32</size>
          <description>HASH Digest K
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[351:320]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the HASHMODE.NEW_HASH bit is 0 when starting a hash session).

New hash:
When initiating a new hash session (theHASHMODE.NEW_HASH bit is 1), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDIGESTL</name>
          <addressOffset>0x6ec</addressOffset>
          <size>32</size>
          <description>HASH Digest L
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[383:352]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the HASHMODE.NEW_HASH bit is 0 when starting a hash session).

New hash:
When initiating a new hash session (theHASHMODE.NEW_HASH bit is 1), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HASHDIGESTM</name>
          <addressOffset>0x6f0</addressOffset>
          <size>32</size>
          <description>HASH Digest M
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[415:384]
Hash digest registers
Write operation:

