thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0x0:  11kohms, minimum resistance, max freq
0x1:  13kohms
0x2:  16kohms
0x3:  20kohms, max resistance, min freq</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCOSC_MF_BIAS_ADJ</name>
              <description>[3:0] Adjusts bias current to RCOSC_MF.

0x8 minimum current
0x0 default current
0x7 maximum current</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STAT0</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Status 0
This register contains status signals from OSC_DIG</description>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_SRC</name>
              <description>[30:29] Indicates source for the sclk_lf</description>
              <bitWidth>2</bitWidth>
              <bitOffset>29</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSCLF</name>
                  <value>3</value>
                  <description>Low frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCLF</name>
                  <value>2</value>
                  <description>Low frequency RCOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHFDLF</name>
                  <value>1</value>
                  <description>Low frequency clock derived from High Frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDLF</name>
                  <value>0</value>
                  <description>Low frequency clock derived from High Frequency RCOSC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_HF_SRC</name>
              <description>[28:28] Indicates source for the sclk_hf</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC</name>
                  <value>1</value>
                  <description>High frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <value>0</value>
                  <description>High frequency RCOSC clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED23</name>
              <description>[27:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RCOSC_HF_EN</name>
              <description>[22:22] RCOSC_HF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>RCOSC_LF_EN</name>
              <description>[21:21] RCOSC_LF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>XOSC_LF_EN</name>
              <description>[20:20] XOSC_LF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CLK_DCDC_RDY</name>
              <description>[19:19] CLK_DCDC_RDY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CLK_DCDC_RDY_ACK</name>
              <description>[18:18] CLK_DCDC_RDY_ACK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SCLK_HF_LOSS</name>
              <description>[17:17] Indicates sclk_hf is lost</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_LOSS</name>
              <description>[16:16] Indicates sclk_lf is lost</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_EN</name>
              <description>[15:15] Indicates that XOSC_HF is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RESERVED14</name>
              <description>[14:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>XB_48M_CLK_EN</name>
              <description>[13:13] Indicates that the 48MHz clock from the  DOUBLER is enabled.

It will be enabled if 24 or 48 MHz crystal is used (enabled in doubler bypass for the 48MHz crystal).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[12:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_LP_BUF_EN</name>
              <description>[11:11] XOSC_HF_LP_BUF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_HP_BUF_EN</name>
              <description>[10:10] XOSC_HF_HP_BUF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[9:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ADC_THMET</name>
              <description>[8:8] ADC_THMET</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_DATA_READY</name>
              <description>[7:7] indicates when adc_data is ready.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ADC_DATA</name>
              <description>[6:1] adc_data</description>
              <bitWidth>6</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PENDINGSCLKHFSWITCHING</name>
              <description>[0:0] Indicates when SCLK_HF clock source is ready to be switched</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STAT1</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Status 1
This register contains status signals from OSC_DIG</description>
          <fields>
            <field>
              <name>RAMPSTATE</name>
              <description>[31:28] AMPCOMP FSM State</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_START_SETTLE</name>
                  <value>14</value>
                  <description>FAST_START_SETTLE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_START</name>
                  <value>13</value>
                  <description>FAST_START</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUMMY_TO_INIT_1</name>
                  <value>12</value>
                  <description>DUMMY_TO_INIT_1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_DEC_W_MEASURE</name>
                  <value>11</value>
                  <description>IDAC_DECREMENT_WITH_MEASURE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_INC</name>
                  <value>10</value>
                  <description>IBIAS_INCREMENT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_UPDATE</name>
                  <value>9</value>
                  <description>LPM_UPDATE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_DEC_W_MEASURE</name>
                  <value>8</value>
                  <description>IBIAS_DECREMENT_WITH_MEASURE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_CAP_UPDATE</name>
                  <value>7</value>
                  <description>IBIAS_CAP_UPDATE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_INCREMENT</name>
                  <value>6</value>
                  <description>IDAC_INCREMENT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_UPDATE</name>
                  <value>5</value>
                  <description>HPM_UPDATE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP3</name>
                  <value>4</value>
                  <description>HPM_RAMP3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP2</name>
                  <value>3</value>
                  <description>HPM_RAMP2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP1</name>
                  <value>2</value>
                  <description>HPM_RAMP1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZATION</name>
                  <value>1</value>
                  <description>INITIALIZATION</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <value>0</value>
                  <description>RESET</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_UPDATE_AMP</name>
              <description>[27:22] XOSC_HF amplitude during HPM_UPDATE state.
When amplitude compensation of XOSC_HF is enabled in high performance mode, this value is the amplitude of the crystal oscillations measured by the on-chip oscillator ADC, divided by 15 mV.  For example, a value of 0x20 would indicate that the amplitude of the crystal is approximately 480 mV.  To enable amplitude compensation, AON_WUC OSCCFG must be set to a non-zero value.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>LPM_UPDATE_AMP</name>
              <description>[21:16] XOSC_HF amplitude during LPM_UPDATE state
When amplitude compensation of XOSC_HF is enabled in low power  mode, this value is the amplitude of the crystal oscillations measured by the on-chip oscillator ADC, divided by 15 mV.  For example, a value of 0x20 would indicate that the amplitude of the crystal is approximately 480 mV.  To enable amplitude compensation, AON_WUC OSCCFG must be set to a non-zero value.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FORCE_RCOSC_HF</name>
              <description>[15:15] force_rcosc_hf</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>SCLK_HF_EN</name>
              <description>[14:14] SCLK_HF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>SCLK_MF_EN</name>
              <description>[13:13] SCLK_MF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>ACLK_ADC_EN</name>
              <description>[12:12] ACLK_ADC_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>ACLK_TDC_EN</name>
              <description>[11:11] ACLK_TDC_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>ACLK_REF_EN</name>
              <description>[10:10] ACLK_REF_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CLK_CHP_EN</name>
              <description>[9:9] CLK_CHP_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CLK_DCDC_EN</name>
              <description>[8:8] CLK_DCDC_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SCLK_HF_GOOD</name>
              <description>[7:7] SCLK_HF_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SCLK_MF_GOOD</name>
              <description>[6:6] SCLK_MF_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_GOOD</name>
              <description>[5:5] SCLK_LF_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ACLK_ADC_GOOD</name>
              <description>[4:4] ACLK_ADC_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ACLK_TDC_GOOD</name>
              <description>[3:3] ACLK_TDC_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ACLK_REF_GOOD</name>
              <description>[2:2] ACLK_REF_GOOD.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_CHP_GOOD</name>
              <description>[1:1] CLK_CHP_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_DCDC_GOOD</name>
              <description>[0:0] CLK_DCDC_GOOD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STAT2</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Status 2
This register contains status signals from AMPCOMP FSM</description>
          <fields>
            <field>
              <name>ADC_DCBIAS</name>
              <description>[31:26] DC Bias read by RADC during SAR mode
The value is an unsigned integer. It is used for debug only.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>HPM_RAMP1_THMET</name>
              <description>[25:25] Indication of threshold is met for hpm_ramp1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>HPM_RAMP2_THMET</name>
              <description>[24:24] Indication of threshold is met for hpm_ramp2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HPM_RAMP3_THMET</name>
              <description>[23:23] Indication of threshold is met for hpm_ramp3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[22:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RAMPSTATE</name>
              <description>[15:12] xosc_hf amplitude compensation FSM

This is identical to STAT1.RAMPSTATE. See that description for encoding.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[11:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_REQ</name>
              <description>[3:3] ampcomp_req</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_AMPGOOD</name>
              <description>[2:2] amplitude of xosc_hf is within the required threshold (set by DDI). Not used for anything just for debug/status</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_FREQGOOD</name>
              <description>[1:1] frequency of xosc_hf is good to use for the digital clocks</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_RF_FREQGOOD</name>
              <description>[0:0] frequency of xosc_hf is within +/- 20 ppm and xosc_hf is good for radio operations. Used for SW to start synthesizer.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
