thenewwazoo/cc1352p1f3/cc1352p1f3.svd
Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <value>119</value>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>115</value>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_OBSMUX0</name>
                  <value>114</value>
                  <description>Loopback of OBSMUX0 through AUX, corresponds to AUX_EVCTL:EVTOMCUFLAGS.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>113</value>
                  <description>AUX ADC FIFO watermark event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>112</value>
                  <description>AUX ADC done, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>111</value>
                  <description>Autotake event from AUX semaphore, configured by AUX_SMPH:AUTOTAKE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>110</value>
                  <description>AUX timer 1 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>109</value>
                  <description>AUX timer 0 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>108</value>
                  <description>AUX TDC measurement done event, corresponds to the flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>107</value>
                  <description>AUX Compare B event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>106</value>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_AON_WU_EV</name>
                  <value>105</value>
                  <description>AON wakeup event, the corresponding flag is here AUX_EVCTL:EVTOMCUFLAGS.AUX_WU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>90</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>89</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <value>68</value>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <value>67</value>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <value>66</value>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <value>65</value>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <value>64</value>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <value>63</value>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <value>62</value>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <value>61</value>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>60</value>
                  <description>AUX Timer2 pulse, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_PULSE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>59</value>
                  <description>AUX Timer2 event 3, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>58</value>
                  <description>AUX Timer2 event 2, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>57</value>
                  <description>AUX Timer2 event 1, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>56</value>
                  <description>AUX Timer2 event 0, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_COMB</name>
                  <value>37</value>
                  <description>UART1 combined interrupt, interrupt flags are found here UART1:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <value>36</value>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_COMB</name>
                  <value>35</value>
                  <description>SSI1 combined interrupt, interrupt flags are found here SSI1:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_COMB</name>
                  <value>34</value>
                  <description>SSI0 combined interrupt, interrupt flags are found here SSI0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_1</name>
                  <value>30</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_0</name>
                  <value>27</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_HW_COMB</name>
                  <value>26</value>
                  <description>Combined RFC hardware interrupt, corresponding flag is here RFC_DBELL:RFHWIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CMD_ACK</name>
                  <value>25</value>
                  <description>RFC Doorbell Command Acknowledgement Interrupt, equvialent to RFC_DBELL:RFACKIFG.ACKFLAG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <value>21</value>
                  <description>FLASH controller error event,  the status flags are FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMB</name>
                  <value>11</value>
                  <description>AUX combined event, the corresponding flag register is here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <value>9</value>
                  <description>Interrupt event from I2C</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_COMB</name>
                  <value>6</value>
                  <description>Combined event from Oscillator control</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_COMB</name>
                  <value>5</value>
                  <description>Combined event from battery monitor</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <value>4</value>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x5A</resetValue>
        </register>
        <register>
          <name>UDMACH0SSEL</name>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH0BSEL</name>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH1SSEL</name>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 1 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RX_DMASREQ</name>
                  <value>49</value>
                  <description>UART0 RX DMA single request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x31</resetValue>
        </register>
        <register>
          <name>UDMACH1BSEL</name>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 1 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <value>48</value>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x30</resetValue>
        </register>
        <register>
          <name>UDMACH2SSEL</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 2 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <value>51</value>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x33</resetValue>
        </register>
        <register>
          <name>UDMACH2BSEL</name>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 2 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <value>50</value>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x32</resetValue>
        </register>
        <register>
          <name>UDMACH3SSEL</name>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 3 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMASREQ</name>
                  <value>41</value>
                  <description>SSI0 RX DMA single request, controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x29</resetValue>
        </register>
        <register>
          <name>UDMACH3BSEL</name>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 3 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMABREQ</name>
                  <value>40</value>
                  <description>SSI0 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x28</resetValue>
        </register>
        <register>
          <name>UDMACH4SSEL</name>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMASREQ</name>
                  <value>43</value>
                  <description>SSI0 TX DMA single request, controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2B</resetValue>
        </register>
        <register>
          <name>UDMACH4BSEL</name>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMABREQ</name>
                  <value>42</value>
                  <description>SSI0 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2A</resetValue>
        </register>
