thenewwazoo/cc1352p1f3/cc1352p1f3.svd
DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <value>69</value>
                  <description>Not used tied to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x45</resetValue>
        </register>
        <register>
          <name>UDMACH9BSEL</name>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 9 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4D</resetValue>
        </register>
        <register>
          <name>UDMACH10SSEL</name>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 10 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <value>70</value>
                  <description>Not used tied to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x46</resetValue>
        </register>
        <register>
          <name>UDMACH10BSEL</name>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 10 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4E</resetValue>
        </register>
        <register>
          <name>UDMACH11SSEL</name>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 11 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <value>71</value>
                  <description>Not used tied to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x47</resetValue>
        </register>
        <register>
          <name>UDMACH11BSEL</name>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 11 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4F</resetValue>
        </register>
        <register>
          <name>UDMACH12SSEL</name>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 12 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

