thenewwazoo/cc1352p1f3/cc1352p1f3.svd
        <register>
          <name>FLASH_VHV_PV</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>TRIM13_PV</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>VHV_PV</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VCG2P5</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VINH</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x80001</resetValue>
        </register>
        <register>
          <name>FLASH_V</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>VSL_P</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>VWL_P</name>
              <description>[23:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>V_READ</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TRIM0P8</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>USER_ID</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>User Identification.
Reading this register and the FCFG1:ICEPICK_DEVICE_ID register is the only supported way of identifying a device.
The value of this register will be written to AON_PMCTL:JTAGUSERCODE by boot FW while in safezone.</description>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>[31:28] Field used to distinguish revisions of the device</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>VER</name>
              <description>[27:26] Version number.

0x0: Bits [25:12] of this register has the stated meaning.

Any other setting indicate a different encoding of these bits.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>PA</name>
              <description>[25:25] 0: Does not support 20dBm PA
1: Supports 20dBM PA</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[24:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CC13</name>
              <description>[23:23] 0: CC26xx device type
1: CC13xx device type</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>[22:19] Sequence.

Used to differentiate between marketing/orderable product where other fields of this register are the same (temp range, flash size, voltage range etc)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>PKG</name>
              <description>[18:16] Package type.

0x0: 4x4mm QFN (RHB) package
0x1: 5x5mm QFN (RSM) package
0x2: 7x7mm QFN (RGZ) package
0x3: Wafer sale package (naked die)
0x4: WCSP (YFV)
0x5: 7x7mm QFN package with Wettable Flanks

Other values are reserved for future use.
Packages available for a specific device are shown in the device datasheet.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>[15:12] Protocols supported.

0x1: BLE 
0x2: RF4CE 
0x4: Zigbee/6lowpan
0x8: Proprietary

More than one protocol can be supported on same device - values above are then combined.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[11:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x30000000</resetValue>
        </register>
        <register>
          <name>FLASH_OTP_DATA3</name>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>[31:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>DO_PRECOND</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>[21:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>TRIM_1P7</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WAIT_SYSCODE</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x110003</resetValue>
        </register>
        <register>
          <name>ANA2_TRIM</name>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>[30:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>SET_RCOSC_HF_FINE_RESISTOR</name>
              <description>[24:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>ATESTLF_UDIGLDO_IBIAS_TRIM</name>
              <description>[22:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>NANOAMP_RES_TRIM</name>
              <description>[21:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[14:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DITHER_EN</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DCDC_IPEAK</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DEAD_TIME_TRIM</name>
              <description>[7:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DCDC_LOW_EN_SEL</name>
              <description>[5:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DCDC_HIGH_EN_SEL</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8240787F</resetValue>
        </register>
        <register>
          <name>LDO_TRIM</name>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP</name>
              <description>[28:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>GLDO_CURSRC</name>
              <description>[18:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[15:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>ITRIM_DIGLDO_LOAD</name>
              <description>[12:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>ITRIM_UDIGLDO</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>VTRIM_DELTA</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xE0F8E0FB</resetValue>
        </register>
        <register>
          <name>MAC_BLE_0</name>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <description>MAC BLE Address 0</description>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>[31:0] The first 32-bits of the 64-bit MAC BLE address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_BLE_1</name>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <description>MAC BLE Address 1</description>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>[31:0] The last 32-bits of the 64-bit MAC BLE address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_15_4_0</name>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <description>MAC IEEE 802.15.4 Address 0</description>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>[31:0] The first 32-bits of the 64-bit MAC 15.4 address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MAC_15_4_1</name>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <description>MAC IEEE 802.15.4 Address 1</description>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>[31:0] The last 32-bits of the 64-bit MAC 15.4 address</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FLASH_OTP_DATA4</name>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>STANDBY_MODE_SEL_INT_WRT</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>STANDBY_PW_SEL_INT_WRT</name>
              <description>[30:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>DIS_STANDBY_INT_WRT</name>
              <description>[28:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DIS_IDLE_INT_WRT</name>
              <description>[27:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>VIN_AT_X_INT_WRT</name>
              <description>[26:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_EXT_WRT</name>
              <description>[23:23] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>STANDBY_PW_SEL_EXT_WRT</name>
              <description>[22:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>DIS_STANDBY_EXT_WRT</name>
              <description>[20:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIS_IDLE_EXT_WRT</name>
              <description>[19:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>VIN_AT_X_EXT_WRT</name>
              <description>[18:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_INT_RD</name>
              <description>[15:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>STANDBY_PW_SEL_INT_RD</name>
              <description>[14:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>DIS_STANDBY_INT_RD</name>
              <description>[12:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIS_IDLE_INT_RD</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>VIN_AT_X_INT_RD</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_EXT_RD</name>
              <description>[7:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>STANDBY_PW_SEL_EXT_RD</name>
              <description>[6:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIS_STANDBY_EXT_RD</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIS_IDLE_EXT_RD</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>VIN_AT_X_EXT_RD</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x98989F9F</resetValue>
        </register>
        <register>
          <name>MISC_TRIM</name>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <description>Miscellaneous Trim  Parameters</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>TRIM_RECHARGE_COMP_OFFSET</name>
              <description>[16:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TRIM_RECHARGE_COMP_REFLEVEL</name>
              <description>[11:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TEMPVSLOPE</name>
              <description>[7:0] Signed byte value representing the TEMP slope with battery voltage, in degrees C / V, with four fractional bits.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFE003B</resetValue>
        </register>
