thenewwazoo/cc1352p1f3/cc1352p1f3.svd
Reading  this registers will return 1 for triggered event and 0 for non-triggered events. 
Writing a 1 to a bit field will clear the event. 

The configuration of events is done inside MCU IOC, e.g. events for DIO #0 is configured in IOC:IOCFG0.EDGE_DET and IOC:IOCFG0.EDGE_IRQ_EN.</description>
          <fields>
            <field>
              <name>DIO31</name>
              <description>[31:31] Event for DIO 31</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>DIO30</name>
              <description>[30:30] Event for DIO 30</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>DIO29</name>
              <description>[29:29] Event for DIO 29</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>DIO28</name>
              <description>[28:28] Event for DIO 28</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>DIO27</name>
              <description>[27:27] Event for DIO 27</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>DIO26</name>
              <description>[26:26] Event for DIO 26</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DIO25</name>
              <description>[25:25] Event for DIO 25</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO24</name>
              <description>[24:24] Event for DIO 24</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DIO23</name>
              <description>[23:23] Event for DIO 23</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>DIO22</name>
              <description>[22:22] Event for DIO 22</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DIO21</name>
              <description>[21:21] Event for DIO 21</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>DIO20</name>
              <description>[20:20] Event for DIO 20</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIO19</name>
              <description>[19:19] Event for DIO 19</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>DIO18</name>
              <description>[18:18] Event for DIO 18</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>DIO17</name>
              <description>[17:17] Event for DIO 17</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO16</name>
              <description>[16:16] Event for DIO 16</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DIO15</name>
              <description>[15:15] Event for DIO 15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>DIO14</name>
              <description>[14:14] Event for DIO 14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DIO13</name>
              <description>[13:13] Event for DIO 13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>DIO12</name>
              <description>[12:12] Event for DIO 12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIO11</name>
              <description>[11:11] Event for DIO 11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DIO10</name>
              <description>[10:10] Event for DIO 10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>DIO9</name>
              <description>[9:9] Event for DIO 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO8</name>
              <description>[8:8] Event for DIO 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIO7</name>
              <description>[7:7] Event for DIO 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DIO6</name>
              <description>[6:6] Event for DIO 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DIO5</name>
              <description>[5:5] Event for DIO 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DIO4</name>
              <description>[4:4] Event for DIO 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIO3</name>
              <description>[3:3] Event for DIO 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DIO2</name>
              <description>[2:2] Event for DIO 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DIO1</name>
              <description>[1:1] Event for DIO 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Event for DIO 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
