thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: The SRIS.STOPRIS interrupt is suppressed and not sent to the interrupt controller.
1: The SRIS.STOPRIS interrupt is enabled and sent to the interrupt controller.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTIM</name>
              <description>[1:1] Start condition interrupt mask

0: The SRIS.STARTRIS interrupt is suppressed and not sent to the interrupt controller.
1: The SRIS.STARTRIS interrupt is enabled and sent to the interrupt controller.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Interrupt</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Interrupt</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAIM</name>
              <description>[0:0] Data interrupt mask

0: The SRIS.DATARIS interrupt is suppressed and not sent to the interrupt controller.
1: The SRIS.DATARIS interrupt is enabled and sent to the interrupt controller.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SRIS</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Slave Raw Interrupt Status
This register shows the unmasked interrupt status.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STOPRIS</name>
              <description>[2:2] Stop condition raw interrupt status

0: No interrupt
1: A Stop condition interrupt is pending.

This bit is cleared by writing a 1 to SICR.STOPIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>STARTRIS</name>
              <description>[1:1] Start condition raw interrupt status

0: No interrupt
1: A Start condition interrupt is pending.

This bit is cleared by writing a 1 to SICR.STARTIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DATARIS</name>
              <description>[0:0] Data raw interrupt status

0: No interrupt
1: A data received or data requested interrupt is pending.

This bit is cleared by writing a 1 to the SICR.DATAIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SMIS</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Slave Masked Interrupt Status
This register show which interrupt is active (based on result from SRIS and SIMR).</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STOPMIS</name>
              <description>[2:2] Stop condition masked interrupt status

0: An interrupt has not occurred or is masked/disabled.
1: An unmasked Stop condition interrupt is pending.

This bit is cleared by writing a 1 to the SICR.STOPIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>STARTMIS</name>
              <description>[1:1] Start condition masked interrupt status

0: An interrupt has not occurred or is masked/disabled.
1: An unmasked Start condition interrupt is pending.

This bit is cleared by writing a 1 to the SICR.STARTIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DATAMIS</name>
              <description>[0:0] Data masked interrupt status

0: An interrupt has not occurred or is masked/disabled.
1: An unmasked data received or data requested interrupt is pending.

This bit is cleared by writing a 1 to the SICR.DATAIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SICR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Slave Interrupt Clear
This register clears the raw interrupt SRIS.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STOPIC</name>
              <description>[2:2] Stop condition interrupt clear

