thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: An interrupt has not occurred or is masked.
1: A master interrupt is pending.

This bit is cleared by writing 1 to the MICR.IC bit .</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MICR</name>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <description>Master Interrupt Clear
This register clears the raw and masked interrupt.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>IC</name>
              <description>[0:0] Interrupt clear
Writing 1 to this bit clears MRIS.RIS and  MMIS.MIS .

Reading this register returns no meaningful data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MCR</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>Master Configuration
This register configures the mode (Master or Slave) and sets the interface for test mode loopback.</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SFE</name>
              <description>[5:5] I2C slave function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Slave mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Slave mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFE</name>
              <description>[4:4] I2C master function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Master mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Master mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LPBK</name>
              <description>[0:0] I2C loopback

0: Normal operation
1: Loopback operation (test mode)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Test Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Test Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S0</name>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>I2S Audio DMA module supporting formats I2S, LJF, RJF and DSP</description>
      <registers>
        <register>
          <name>AIFWCLKSRC</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>WCLK Source Selection</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WCLK_INV</name>
              <description>[2:2] Inverts WCLK source (pad or internal) when set.

0: Not inverted
1: Inverted</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WCLK_SRC</name>
              <description>[1:0] Selects WCLK source for AIF (should be the same as the BCLK source). The BCLK source is defined in the PRCM:I2SBCLKSEL.SRC</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <value>3</value>
                  <description>Not supported. Will give same WCLK as 'NONE' ('00')</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <value>2</value>
                  <description>Internal WCLK generator, from module PRCM</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <value>1</value>
                  <description>External WCLK generator, from pad</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>None ('0')</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFDMACFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>DMA Buffer Size Configuration</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>END_FRAME_IDX</name>
              <description>[7:0] Defines the length of the DMA buffer. Writing a non-zero value to this register field enables and initializes AIF. Note that before doing so, all other configuration must have been done, and AIFINPTRNEXT/AIFOUTPTRNEXT must have been loaded.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFDIRCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Pin Direction</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AD1</name>
              <description>[5:4] Configures the AD1 audio data pin usage:

0x3: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>2</value>
                  <description>Output mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Not in use (disabled)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AD0</name>
              <description>[1:0] Configures the AD0 audio data pin usage:

0x3: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <value>2</value>
                  <description>Output mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <value>1</value>
                  <description>Input mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Not in use (disabled)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AIFFMTCFG</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Serial Interface Format Configuration</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DATA_DELAY</name>
              <description>[15:8] The number of BCLK periods between a WCLK edge and MSB of the first word in a phase:

0x00: LJF and DSP format
0x01: I2S and DSP format
0x02: RJF format
...
0xFF: RJF format

Note: When 0, MSB of the next word will be output in the idle period between LSB of the previous word and the start of the next word. Otherwise logical 0 will be output until the data delay has expired.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_LEN_24</name>
              <description>[7:7] The size of each word stored to or loaded from memory:</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <value>1</value>
                  <description>24-bit (one 8 bit and one 16 bit locked access per sample)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BIT</name>
                  <value>0</value>
                  <description>16-bit (one 16 bit access per sample)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPL_EDGE</name>
              <description>[6:6] On the serial audio interface, data (and wclk) is sampled and clocked out on opposite edges of BCLK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <value>1</value>
                  <description>Data is sampled on the positive edge and clocked out on the negative edge.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>0</value>
                  <description>Data is sampled on the negative edge and clocked out on the positive edge.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUAL_PHASE</name>
              <description>[5:5] Selects dual- or single-phase format.

