thenewwazoo/cc1352p1f3/cc1352p1f3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA_INT</name>
      <baseAddress>0x40027000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Integrated module which includes the PKA K</description>
      <registers>
        <register>
          <name>RESERVED_0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>OPTIONS</name>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <description>PKA Options register</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Ignore on read</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AIC_PRESENT</name>
              <description>[10:10] When set to '1', indicates that an EIP201 AIC  is included in the EIP150</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>EIP76_PRESENT</name>
              <description>[9:9] When set to '1', indicates that the EIP76 TRNG  is included in the EIP150</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>EIP28_PRESENT</name>
              <description>[8:8] When set to '1', indicates that the EIP28 PKA is included in the EIP150</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AXI_INTERFACE</name>
              <description>[3:3] When set to '1', indicates that the EIP150 is equipped with a AXI interface</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AHB_IS_ASYNC</name>
              <description>[2:2] When set to '1', indicates that AHB interface is asynchronous  Only applicable when AHB_INTERFACE is 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AHB_INTERFACE</name>
              <description>[1:1] When set to '1', indicates that the EIP150 is equipped with a AHB interface</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PLB_INTERFACE</name>
              <description>[0:0] When set to '1', indicates that the EIP150 is equipped with a PLB interface</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x102</resetValue>
        </register>
        <register>
          <name>REVISION</name>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <description>PKA hardware revision register
This register allows the host access to the hardware revision number of the PKA engine for software driver matching and diagnostic purposes. It is always located at the highest address in the access space of the module and contains an encoding of the EIP number (with its complement as signature) for recognition of the hardware module.</description>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] These bits should be ignored on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MAJOR_REVISION</name>
              <description>[27:24] These bits encode the major version number for this module</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MINOR_REVISION</name>
              <description>[23:20] These bits encode the minor version number for this module</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>PATCH_LEVEL</name>
              <description>[19:16] These bits encode the hardware patch level for this module they start at value 0 on the first release</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>COMP_EIP_NUM</name>
              <description>[15:8] These bits simply contain the complement of bits [7:0], used by a driver to ascertain that the EIP150 revision register is indeed read</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EIP_NUM</name>
              <description>[7:0] These bits encode the AuthenTec EIP number for the EIP150</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2006996</resetValue>
        </register>
