thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: Disable clock
1: Enable clock 

Can be forced on by AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKGS</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>GPT Clock Gate For Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] Each bit below has the following meaning:

0: Disable clock
1: Enable clock

Can be forced on by GPTCLKGR.AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKGDS</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>GPT Clock Gate For Deep Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] Each bit below has the following meaning:

0: Disable clock
1: Enable clock

Can be forced on by GPTCLKGR.AM_CLK_EN

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <value>8</value>
                  <description>Enable clock for GPT3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <value>4</value>
                  <description>Enable clock for GPT2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <value>2</value>
                  <description>Enable clock for GPT1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <value>1</value>
                  <description>Enable clock for GPT0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2CCLKGR</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>I2C Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[8:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  I2CCLKGS.CLK_EN and  I2CCLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

