thenewwazoo/cc1352p1f3/cc1352p1f3.svd
0: Burst Mode enabled.
1: Burst Mode off.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAGE</name>
              <description>[4:4] Page Mode select

0: Page Mode disabled. Memory works in standard mode
1: Page Mode enabled. Only one  half of butterfly array selected. Page Mode will select either LSB half or MSB half of the word based on PGS setting. 

This mode can be used for additional power saving</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PGS</name>
              <description>[3:3] 0: Select LSB half of word during Page Mode, PAGE = 1
1: Select MSB half of word during Page Mode, PAGE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>BM</name>
              <description>[2:2] Burst Mode Enable

0: Burst Mode Disable. Memory works in standard mode.
1: Burst Mode Enable

When in Burst Mode bitline precharge and wordline firing depends on PCH_F and PCH_L.
Burst Mode results in reduction in active power.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PCH_F</name>
              <description>[1:1] 0: No bitline precharge in second half of cycle
1: Bitline precharge in second half of cycle when in Burst Mode, BM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PCH_L</name>
              <description>[0:0] 0: No bitline precharge in first half of cycle
1: Bitline precharge in first half of cycle when in Burst Mode, BM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x20</resetValue>
        </register>
        <register>
          <name>RAMRETEN</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>Memory Retention Control</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RFCULL</name>
              <description>[3:3] 0: Retention for RFC ULL SRAM disabled 
1: Retention for RFC ULL SRAM enabled 

Memories controlled:
CPEULLRAM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC</name>
              <description>[2:2] 0: Retention for RFC SRAM disabled  
1: Retention for RFC SRAM enabled  

Memories controlled: CPERAM  MCERAM  RFERAM  DSBRAM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VIMS</name>
              <description>[1:0] 0: Memory retention disabled
1: Memory retention enabled  

Bit 0: VIMS_TRAM 
Bit 1: VIMS_CRAM  

Legal modes depend on settings in VIMS:CTL.MODE  

00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to CACHE or SPLIT mode after waking up again 
01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in GPRAM mode after wake up, alternatively select OFF mode first and then CACHE or SPILT mode. 
10: Illegal mode 
11: No restrictions</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>OSCIMSC</name>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <description>Oscillator Interrupt Mask</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HFSRCPENDIM</name>
              <description>[7:7] 0: Disable interrupt generation when HFSRCPEND is qualified
1: Enable interrupt generation when HFSRCPEND is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>LFSRCDONEIM</name>
              <description>[6:6] 0: Disable interrupt generation when LFSRCDONE is qualified
1: Enable interrupt generation when LFSRCDONE is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>XOSCDLFIM</name>
              <description>[5:5] 0: Disable interrupt generation when XOSCDLF is qualified
1: Enable interrupt generation when XOSCDLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>XOSCLFIM</name>
              <description>[4:4] 0: Disable interrupt generation when XOSCLF is qualified
1: Enable interrupt generation when XOSCLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCOSCDLFIM</name>
              <description>[3:3] 0: Disable interrupt generation when RCOSCDLF is qualified
1: Enable interrupt generation when RCOSCDLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RCOSCLFIM</name>
              <description>[2:2] 0: Disable interrupt generation when RCOSCLF is qualified
1: Enable interrupt generation when RCOSCLF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSCHFIM</name>
              <description>[1:1] 0: Disable interrupt generation when XOSCHF is qualified
1: Enable interrupt generation when XOSCHF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RCOSCHFIM</name>
              <description>[0:0] 0: Disable interrupt generation when RCOSCHF is qualified
1: Enable interrupt generation when RCOSCHF is qualified</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x36</resetValue>
        </register>
        <register>
          <name>OSCRIS</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>Oscillator Raw Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HFSRCPENDRIS</name>
              <description>[7:7] 0: HFSRCPEND has not been qualified
1: HFSRCPEND has been qualified since last clear 

Interrupt is qualified regardless of OSCIMSC.HFSRCPENDIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

